# Brewfile — Homebrew パッケージ一覧
# インストール: brew bundle install --file=Brewfile
# 更新:         brew bundle dump --force --file=Brewfile

# =============================================================================
# CLI ツール（必須）
# =============================================================================
brew "git"           # Git 最新版（macOS 付属のものより新しい）
brew "zsh"           # zsh 最新版
brew "tmux"          # ターミナルマルチプレクサ
brew "starship"      # クロスシェルプロンプト

# =============================================================================
# CLI ツール（モダン Unix）
# =============================================================================
brew "eza"           # ls の代替（アイコン・Git 表示）
brew "bat"           # cat の代替（シンタックスハイライト）
brew "fd"            # find の代替（速い・使いやすい）
brew "ripgrep"       # grep の代替（爆速）
brew "fzf"           # ファジーファインダー
brew "zoxide"        # cd の強化版（よく行くディレクトリを記憶）
brew "git-delta"     # git diff のシンタックスハイライト
brew "ghq"           # Git リポジトリをディレクトリ構造で管理
brew "jq"            # JSON プロセッサ
brew "yq"            # YAML プロセッサ
brew "mise"          # Node.js / Python / Ruby などのバージョン管理

# =============================================================================
# Claude Code CLI
# =============================================================================
# npm でインストールするため brew では管理しない
# mise で Node.js を入れてから: npm install -g @anthropic-ai/claude-code

# =============================================================================
# フォント（Nerd Font）
# =============================================================================
cask "font-jetbrains-mono-nerd-font"   # Ghostty の推薦フォント
# cask "font-hack-nerd-font"
# cask "font-fira-code-nerd-font"

# =============================================================================
# アプリケーション
# =============================================================================
cask "ghostty"       # ターミナルエミュレータ（本リポジトリの主役）
# cask "visual-studio-code"
# cask "raycast"
