# Brewfile — Homebrew パッケージ一覧
# インストール: brew bundle install --file=Brewfile
# 更新:         brew bundle dump --force --file=Brewfile

# =============================================================================
# CLI ツール（必須）
# =============================================================================
brew "git"           # Git 最新版（macOS 付属のものより新しい）
brew "zsh"           # zsh 最新版
brew "tmux"          # ターミナルマルチプレクサ
brew "oh-my-posh"    # プロンプトエンジン（カスタムテーマ対応）

# =============================================================================
# CLI ツール（モダン Unix）
# =============================================================================
brew "eza"           # ls の代替（アイコン・Git 表示）
brew "bat"           # cat の代替（シンタックスハイライト）
brew "fd"            # find の代替（速い・使いやすい）
brew "ripgrep"       # grep の代替（爆速）
brew "fzf"           # ファジーファインダー
brew "zoxide"        # cd の強化版（よく行くディレクトリを記憶）
brew "git-delta"     # git diff のシンタックスハイライト
brew "ghq"           # Git リポジトリをディレクトリ構造で管理
brew "jq"            # JSON プロセッサ
brew "yq"            # YAML プロセッサ
brew "mise"          # Node.js / Python / Ruby などのバージョン管理
brew "lazygit"       # Git TUI（ステージング・リベース等をキーボード操作）
brew "gh"            # GitHub CLI（PR 作成・issue 確認・レビューをターミナルで完結）
brew "glow"          # ターミナルでの Markdown プレビュー
brew "direnv"        # ディレクトリ別の環境変数を .envrc で自動ロード
brew "zsh-autosuggestions"    # 入力履歴からゴーストテキストで補完候補を表示
brew "zsh-syntax-highlighting" # 入力中のコマンドをリアルタイムで色分け
brew "neovim"                 # テキストエディタ（Vim 互換、Lua 設定対応）

# =============================================================================
# Claude Code CLI
# =============================================================================
# npm でインストールするため brew では管理しない
# mise で Node.js を入れてから: npm install -g @anthropic-ai/claude-code

# =============================================================================
# フォント（Nerd Font）
# =============================================================================
cask "font-jetbrains-mono-nerd-font"   # JetBrains Mono Nerd Font
cask "font-udev-gothic-nf"             # UDEV Gothic NF（BIZ UD Gothic + JetBrains Mono 合成、日本語等幅・Nerd Font・リガチャ対応）
# cask "font-hack-nerd-font"
# cask "font-fira-code-nerd-font"

# =============================================================================
# アプリケーション
# =============================================================================
cask "ghostty"       # ターミナルエミュレータ（本リポジトリの主役）
# cask "visual-studio-code"
# cask "raycast"
